tap "cmacrae/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "bat"
brew "fzf"
brew "git"
brew "gitui"
brew "htop"
brew "lsd"
brew "mas"
brew "neofetch"
brew "nvm"
# brew "fnm" # Nvm but fast
brew "p7zip"
brew "ranger"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "gitmux"
brew "trash"
brew "wget"
brew "neovim"
brew "zsh"
brew "qmk/qmk/qmk"
brew "yabai"
brew "skhd"

# cask "alt-tab"
cask "authy"
cask "bitwarden"
cask "brave-browser"
cask "devtoys"
cask "discord"
cask "dozer"
cask "fig"
cask "google-drive"
cask "iterm2"
cask "alacritty"
cask "karabiner-elements"
cask "mos"
cask "notion"
cask "raycast"
cask "runjs"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "dbeaver-community"

cask "font-cascadia-code" # Vscode font
cask "font-hack-nerd-font" # iTerm and Alacritty font

mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Notion Web Clipper", id: 1559269364
mas "Tomito", id: 1526042938
